Revit 2026 API

# RebarGetShapeId Method

---

Returns the id of the RebarShape element that defines the shape of the rebar.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetShapeId()
```
```vb
Public Function GetShapeId As ElementId
```
```cpp
public:
ElementId^ GetShapeId()
```
```fsharp
member GetShapeId : unit -> ElementId
```

#### Return Value

ElementId

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This Rebar is matched with multiple shapes. |

A Free Form Rebar that has Workshop Instructions set to Bent is considered to have multiple shapes and this method will throw exception.

A Free Form Rebar that has Workshop Instructions set to Straight or a Shape Driven is considered to have only one shape and this method will return the id of that shape.

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace